{
  "website-title":"DapaoHuang's Space",
  "page-top-title": "Main Page",
  "update-title": "Updating!  <span class=\"online-dot\"></span>",
  "update-announce": "🚀Website is currently updating! Last active time: 15:13 04/04/2025<br><br>This time, the display and memory usage of blog articles on different clients have been optimized! <br>And a new calling method has been applied!:)",
  "intro-title": "Intro",
  "intro-content": "Hi there! Hope this finds you well.<br><br>I'm currently pursuing a Master's Degree in Financial Mathematics, at Miami Herbert Business School, University of Miami in Miami, Florida.<br><br>I’m a results-oriented quantitative analyst with a strong foundation in time series analysis and quantitative finance. I have hands-on experience conducting real-time simulated backtesting of various trading strategies using Alpaca API and Python, and further optimizing algorithmic trading practices by integrating machine learning techniques based on backtesting results. Through extensive industry research, I have developed a solid understanding of agricultural and precious metals markets. I am proficient in multiple programming languages and databases, enabling efficient data mining, analysis, and visualization using Excel and Excel VBA. Additionally, I have contributed to multiple investment projects, gaining valuable hands-on experience in the field.",
  "edu-title": "Education",
  "edu-mhbs-title": "University of Miami Herbert Business School",
  "edu-mhbs-degree": "M.Sc. in Financial Mathematics&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "edu-mhbs-periodnbase": "Aug. 2024 - May 2025 (expected)<br>Miami, Florida, United States",
  "edu-mhbs-classes": "<b>Main Classes: </b>Real Estate Finance | Mathematics of Financial Derivatives | Behavioral Finance | Quantitative Finance and Market Microstructure | Fixed Income | Financial Modeling | Advanced Financial Modeling | PE & VC | Wealth Management",
  "edu-gdufe-title": "Guangdong University of Finance and Economics",
  "edu-gdufe-degree": "B.Sc. in Financial Engineering&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "edu-gdufe-periodnbase": "Sep. 2020 – Jun. 2024<br>Guangzhou, Guangdong, China",
  "email-title": "Emails",
  "personal-key-word-title": "Personal Interests Keywords",
  "personal-key-word": "Python, Excel VBA, Stata, Matlab, Tableau, Commodities...",
  "experiences-subtitle": "<i class=\"bi bi-pencil-fill\"></i>&nbsp;EXPERIENCES",
  "experiences-mhbs-smcf-a-title": "University of Miami Herbert Business School",
  "experiences-mhbs-smcf-a-position": "Student Managed Conviction Fund&nbsp;|&nbsp;Analyst&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "experiences-mhbs-smcf-a-periodnbase": "Aug 2024 - Present<br>Miami, Florida, United States · On-site",
  "experiences-mhbs-smcf-a-detail": "1. Present as an analyst in Finance & Real Estate Sector, evaluate stocks in the sector and generate reports.<br><br>2. Authored valuation reports on an individual stock, with recommended stock successfully included in the initial live portfolio.<br><br>As of 11/13/2024, it was evaluated that GS would reach $631.90 from the spot price of $594.22. On 01/22/2025, GS stock price reached $632.73.<br><br>",
  "experiences-mhbs-smcf-a-skill": "<strong>Skills:</strong> Pricing Analysis, Financial Concepts, Market Pricing, Macroeconomics Analysis, P/E P/B Ratio Evaluation, DCF, DDM",
  "experiences-cc-lyn-title": "Curveway Confluence (Guangzhou) Big Data Investment Center",
  "experiences-cc-sms-position": "Systems Maintenance Specialist&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "experiences-cc-sms-periodnbase": "Freelance<br>Jul 2024 - Present<br>Remote",
  "experiences-cc-sms-detail": "1. Developed an automated quantitative monitoring system integrated with Lark bot, enabling real-time stock price and quantitative indicator alerts for multiple China Mainland listed companies, along with scheduled market data distribution and global market brief report. <br><br>2. Built a multi-term bond yield analysis system based on partial data from Chinese and U.S. bond markets, integrating Nelson-Siegel fitting and forward rate calculations to identify arbitrage opportunities and optimize fixed-income strategies. <br><br>3. Developed and tested an integrated system that leverages machine learning for forecasting S&P 500 returns while incorporating an optimal momentum strategy with multi-term lag features, PCA for dimensionality reduction, and genetic algorithm optimization. Evaluated linear regression, FFNN, and LSTM models through backtesting and visualized PCA insights using Excel and matplotlib to support stock market analysis. <br><br>4. Constructed a Python-based Dow 30 portfolio optimization system, integrating Markowitz optimization and a genetic algorithm to optimize the Sharpe ratio under weight constraints. Evaluated performance on training and test data using annualized return, volatility, and Sharpe ratio metrics. <br><br>5. Assisted in maintaining quantitative analysis modules, information systems, and subscription systems, addressing unexpected issues and improving system stability.<br><br>6. Participated in the development and maintenance of the company's website and email system. <br><br>7. Continuously optimized the company’s quantitative analysis system, adding market data processing and factor analysis modules. <br><br>",
  "experiences-cc-sms-skill": "<strong>Skills:</strong> Python, Financial Concepts, HTML, JavaScript, Raspberry Pi, HTML, C++, Website Development, CSS, Quantitative Finance",
  "experiences-cc-iaa-position": "Investment Analysis Assistant&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "experiences-cc-iaa-periodnbase": "Internship<br>Dec 2023 - Jul 2024<br>On-site · Guangzhou, Guangdong, China",
  "experiences-cc-iaa-detail": "1. Built a model using Python to update, cross-verify, and analyze data.<br><br>2. Used PCA + GA to predict trends in Southeast Asian markets.<br><br>3. Completed commodity analysis on gold and eggs.<br><br>4. Developed a quantitative analysis system, a mail subscription & bot push system, and a stock recommendation system.<br><br>",
  "experiences-cc-iaa-skill": "<strong>Skills:</strong> Python, Data Analysis, SQL, Excel VBA, Financial Concepts, Quantitative Analytics, Commodity Pricing, Tableau, Industry Analysis, Quantitative Research",
  "click-guide": "<strong>Click</strong> on the pictures below to see details:",
  "experiences-cc-project1-time": "Nov 29th 2023",
  "experiences-cc-project1-title": "Gold's 30 Years-2023112715360001-PRDV",
  "project1-download-hint": "Download",
  "project1-preview-hint": "Web Preview (Preparing)",
  "experiences-cc-project2-time": "Dec 27th 2023",
  "experiences-cc-project2-title": "Evergrande's dusk: bonds and commercial bills-2023122721570002-PRDV",
  "project2-download-hint": "Download",
  "project2-preview-hint": "Web Preview (Preparing)",
  "experiences-pdx-title": "Paradox Interactive",
  "experiences-pdx-ca-position": "Community Ambassador for China - Stellaris&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "experiences-pdx-ca-periodnbase": "Freelance<br>May 2024 - Present<br>Remote",
  "experiences-pdx-ca-detail": "1. Monitor multi-platforms’ reviews for the game Stellaris using semantic analysis to gather player feedback and produce weekly reports to support game optimization and market strategies.<br><br>2. Liaise between the Stellaris development team and Chinese players to ensure accurate information delivery.<br><br>3. Actively engage with the community, plan engagement activities to boost player participation and satisfaction and manage community relations.<br><br>4. Successfully managed a PR crisis by providing decision-makers with comprehensive information and well-founded recommendations to support effective decision-making.<br><br>",
  "experiences-pdx-ca-skill": "<strong>Skills:</strong> Community Management, Data Crawling & Analysis, Translation, Technical Writing",
  "experiences-haid-ci-title": "Guangdong Haid Group Co., Limited",
  "experiences-haid-ci-position": "Commodity Intern&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "experiences-haid-ci-periodnbase": "Internship<br>Jul 2023 - Nov 2023<br>On-site · Guangzhou, Guangdong, China",
  "experiences-haid-ci-detail": "1. Refined hedging models and analyzed data for the hog farming department.<br><br>2. Used Python and VBA for daily automatic updates of reports.<br><br>3. Conducted on-site research on hog farming enterprises.<br><br>",
  "experiences-haid-ci-skill": "<strong>Skills:</strong> Commodity Markets, Python, Data Analysis, Excel VBA, Financial Concepts, Pricing Strategy, Commodity Pricing, Industry Analysis",
  "experiences-suswave-title": "SusallWave Digital Technology Co., Ltd.",
  "experiences-suswave-rai-position": "ESG Risk Analysis Intern&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "experiences-suswave-rai-periodnbase": "Internship<br>Mar 2023 - May 2023<br>On-site · Guangdong, China",
  "experiences-suswave-rai-detail": "1. Extracted 3000+ negative information pieces from government websites using Requests and Selenium.<br><br>2. Conducted correlation analysis among companies using Python and Apriori algorithm.<br><br>",
  "experiences-suswave-rai-skill": "<strong>Skills:</strong> Web Crawling, Python, Data Analysis",
  "experiences-cop-title": "CnOpenData",
  "experiences-cop-da-position": "Data Assistant&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "experiences-cop-da-periodnbase": "Internship<br>Oct 2022 - Apr 2023<br>Guangzhou, Guangdong, China · Remote",
  "experiences-cop-da-detail": "1. Expanded industry database categories and improved data for six databases.<br><br>2. Used Python to collect, organize, and normalize 169,700 index entries.<br><br>",
  "experiences-cop-da-skill": "<strong>Skills:</strong> Data Mining, Python, Data Analysis, SQL",
  "publications-subtitle": "<i class=\"bi bi-file-text-fill\"></i>&nbsp;PUBLICATIONS",
  "publications-ainqf-title": "<em>Artificial Intelligence and Quantitative Finance</em>",
  "publications-ainqf-what": "Chapter Author - Chapter 7: Principal Component Analysis (PCA)&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "publications-ainqf-info": "Book Contribution<br>Publisher: Tsinghua University Press<br>Expected Publication: February 2025",
  "publications-ainqf-detail": "Authored Chapter 7, titled “Principal Component Analysis (PCA),” which explores PCA as a dimensionality reduction technique for extracting essential information from high-dimensional datasets. The chapter includes the theoretical foundation, practical implementation, and applications in financial data processing, such as data cleaning, standardization, feature extraction, risk management, and portfolio construction. Python code examples and visual aids are provided to enhance understanding and practical application.",
  "awards-subtitle": "<i class=\"bi bi-award-fill\"></i>&nbsp;AWARDS"
}
