{
  "website-title":"DapaoHuang's Space",
  "page-top-title": "Main Page",
  "update-title": "Updating!  <span class=\"online-dot\"></span>",
  "update-announce": "🚀Website is currently updating! Last active time: 00:29 03/07/2025<br><br>Introducing the localization function and a brand new \"back-to-top\" button in this update (just right down that corner!).<br>And some new changes in .js&.yml to keep the tidiness:)",
  "intro-title": "Intro",
  "intro-content": "Hi there! Hope this finds you well.<br><br>I'm currently pursuing a Master's Degree in Financial Mathematics, at Miami Herbert Business School, University of Miami in Miami, Florida.<br><br>I’m a results-oriented quantitative analyst with a strong foundation in time series analysis and quantitative finance. I have hands-on experience conducting real-time simulated backtesting of various trading strategies using Alpaca API and Python, and further optimizing algorithmic trading practices by integrating machine learning techniques based on backtesting results. Through extensive industry research, I have developed a solid understanding of agricultural and precious metals markets. I am proficient in multiple programming languages and databases, enabling efficient data mining, analysis, and visualization using Excel and Excel VBA. Additionally, I have contributed to multiple investment projects, gaining valuable hands-on experience in the field.",
  "edu-title": "Education",
  "edu-mhbs-title": "University of Miami Herbert Business School",
  "edu-mhbs-degree": "M.Sc. in Financial Mathematics&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "edu-mhbs-periodnbase": "Aug. 2024 - May 2025 (expected)<br>Miami, Florida, United States",
  "edu-mhbs-classes": "<b>Main Classes: </b>Real Estate Finance | Mathematics of Financial Derivatives | Behavioral Finance | Quantitative Finance and Market Microstructure | Fixed Income | Financial Modeling | Advanced Financial Modeling | PE & VC | Wealth Management",
  "edu-gdufe-title": "Guangdong University of Finance and Economics",
  "edu-gdufe-degree": "B.Sc. in Financial Engineering&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "edu-gdufe-periodnbase": "Sep. 2020 – Jun. 2024<br>Guangzhou, Guangdong, China",
  "email-title": "Emails",
  "personal-key-word-title": "Personal Interests Keywords",
  "personal-key-word": "Python, Excel VBA, Stata, Matlab, Tableau, Commodities...",
  "experiences-subtitle": "<i class=\"bi bi-pencil-fill\"></i>&nbsp;EXPERIENCES",
  "experiences-mhbs-smcf-a-title": "University of Miami Herbert Business School",
  "experiences-mhbs-smcf-a-position": "Student Managed Conviction Fund&nbsp;|&nbsp;Analyst&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "experiences-mhbs-smcf-a-periodnbase": "Aug 2024 - Present<br>Miami, Florida, United States · On-site",
  "experiences-mhbs-smcf-a-detail": "1. Present as an analyst in Finance & Real Estate Sector, evaluate stocks in the sector and generate reports.<br><br>2. Authored valuation reports on an individual stock, with recommended stock successfully included in the initial live portfolio.<br><br>As of 11/13/2024, it was evaluated that GS would reach $631.90 from the spot price of $594.22. On 01/22/2025, GS stock price reached $632.73.<br><br>",
  "experiences-mhbs-smcf-a-skill": "<strong>Skills:</strong> Pricing Analysis, Financial Concepts, Market Pricing, Macroeconomics Analysis, P/E P/B Ratio Evaluation, DCF, DDM",
  "experiences-cc-lyn-title": "Curveway Confluence (Guangzhou) Big Data Investment Center",
  "experiences-cc-sms-position": "Systems Maintenance Specialist&nbsp;&nbsp;<span class=\"online-dot\"></span>",
  "experiences-cc-sms-periodnbase": "Freelance<br>Jul 2024 - Present<br>Remote",
  "experiences-cc-sms-detail": "1. Developed an automated quantitative monitoring system integrated with Lark bot, enabling real-time stock price and quantitative indicator alerts for multiple domestic listed companies, along with scheduled market data distribution and global market brief report. <br><br>2. Built a multi-term bond yield analysis system based on partial data from Chinese and U.S. bond markets, integrating Nelson-Siegel fitting and forward rate calculations to identify arbitrage opportunities and optimize fixed-income strategies. <br><br>3. Developed and tested an integrated system that leverages machine learning for forecasting S&P 500 returns while incorporating an optimal momentum strategy with multi-term lag features, PCA for dimensionality reduction, and genetic algorithm optimization. Evaluated linear regression, FFNN, and LSTM models through backtesting and visualized PCA insights using Excel and matplotlib to support stock market analysis. <br><br>4. Constructed a Python-based Dow 30 portfolio optimization system, integrating Markowitz optimization and a genetic algorithm to optimize the Sharpe ratio under weight constraints. Evaluated performance on training and test data using annualized return, volatility, and Sharpe ratio metrics. <br><br>5. Assisted in maintaining quantitative analysis modules, information systems, and subscription systems, addressing unexpected issues and improving system stability.<br><br>6. Participated in the development and maintenance of the company's website and email system. <br><br>7. Continuously optimized the company’s quantitative analysis system, adding market data processing and factor analysis modules. <br><br>",
  "experiences-cc-sms-skill": "<strong>Skills:</strong> Python, Financial Concepts, HTML, JavaScript, Raspberry Pi, HTML, C++, Website Development, CSS, Quantitative Finance",
  "experiences-cc-iaa-position": "Investment Analysis Assistant&nbsp;&nbsp;<span class=\"past-dot\"></span>",
  "experiences-cc-iaa-periodnbase": "Internship<br>Dec 2023 - Jul 2024<br>On-site · Guangzhou, Guangdong, China",
  "experiences-cc-iaa-detail": "1. Built a model using Python to update, cross-verify, and analyze data.<br><br>2. Used PCA + GA to predict trends in Southeast Asian markets.<br><br>3. Completed commodity analysis on gold and eggs.<br><br>4. Developed a quantitative analysis system, a mail subscription & bot push system, and a stock recommendation system.<br><br>",
  "experiences-cc-iaa-skill": "<strong>Skills:</strong> Python, Data Analysis, SQL, Excel VBA, Financial Concepts, Quantitative Analytics, Commodity Pricing, Tableau, Industry Analysis, Quantitative Research",
  "click-guide": "<strong>Click</strong> on the pictures below to see details:",
  "": ""

}